app/views/main/index.html.erb


                <% user.events.each do |event| %>
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 2]]