app/views/events/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ?  [["user_id", 2]]
---

<% Current.user.events.each do |event| %>