app/controllers/events_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
---
    def edit
        @event = Current.user.events.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["title", "baseball ? anyone"], ["content", "I want to play it!!! == hhhhhhh"], ["updated_at", "2023-11-30 06:30:42.548481"], ["id", 5]]
---
    def update
        @event = Current.user.events.find(params[:id])
        if @event.update(event_params)

INSERT INTO "events" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "baseball"], ["content", "I want to play it!!! =="], ["user_id", 2], ["created_at", "2023-11-30 06:30:14.363459"], ["updated_at", "2023-11-30 06:30:14.363459"]]
---
    def create
        @user = Current.user
        @event = @user.events.build(event_params)

        if @event.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = ? AND "events"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
    def destroy
        @event = Current.user.events.find(params[:id])
        @event.destroy