app/controllers/main_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "users".* FROM "users"
---
    def index
        if session[:user_id]
            @user = User.find(session[:user_id])
        end
        @users = User.all