app/controllers/session_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def create
        # user = User.find(email: params[:email])
        user = User.find(params[:id])